<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Google Drive disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dankeller.munki.GoogleDrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleDrive</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/google</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Google Drive sync for Mac. Access files on your computer from anywhere.</string>
            <key>display_name</key>
            <string>Google Drive</string>
            <key>name</key>
            <string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>10.6</string>
            <key>unattended_install</key>
            <true/>
            <key>postinstall_script</key>
            <string>#!/bin/sh

# Appreciatively copied from
# https://github.com/Ginja/Admin_Scripts/blob/master/google_drive_helper.rb

cp \
        &apos;/Applications/Google Drive.app/Contents/Resources/Google Drive Icon Helper&apos; \
        &apos;/Library/PrivilegedHelperTools/Google Drive Icon Helper&apos;

chmod 6755 &apos;/Library/PrivilegedHelperTools/Google Drive Icon Helper&apos;
chown root:procmod &apos;/Library/PrivilegedHelperTools/Google Drive Icon Helper&apos;
</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dankeller.download.GoogleDrive</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
