<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads current Intego VirusBarrier X6 installer.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.recipes-dankeller.download.virusbarrier-x6</string>
	<key>Input</key>
	<dict>
		<key>DMG_NAME</key>
		<string>VirusBarrierX6.dmg</string>
		<key>PKG_LOCATION</key>
		<string>VirusBarrier X6 Installer.app/Contents/Resources</string>
		<key>PKG_NAME</key>
		<string>VirusBarrierX6.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.integodownload.com/mac1/X/%DMG_NAME%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>