<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Intego VirusBarrier 2013 installer.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.recipes-dankeller.download.virusbarrier-2013</string>
	<key>Input</key>
	<dict>
		<key>DMG_NAME</key>
		<string>VirusBarrier_2013.dmg</string>
		<key>INSTALLER_APP</key>
		<string>VirusBarrier Installer.app</string>
		<key>PKG_NAME</key>
		<string>VirusBarrier.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The dankeller-recipes repo, which contains this recipe, will be archived soon. Please remove this recipe from your AutoPkg run list. (Details: https://github.com/autopkg/dankeller-recipes/issues/13)</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.integodownload.com/mac1/X/2013/%DMG_NAME%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
